var DATA = {
  Город: [{ orgname: "Название" }],
  Барнаул: [
    { orgname: "КГБУСО «Краевой Кризисный Центр для Женщин»" },
    {
      orgname:
        "Алтайская региональная общественная организация по предотвращению насилия «Право на счастье»",
    },
  ],
  Архангельск: [
    { orgname: "ГБУ Архангельской области Центр реабилитации «Родник»" },
    {
      orgname:
        'Архангельская Региональная Общественная Организация «Кризисный центр "Надежда"»',
    },
  ],
  Северодвинск: [
    {
      orgname:
        "МБОУ для детей, нуждающихся в психолого-педагогической и медико-социальной помощи «Центр диагностики и консультирования»",
    },
  ],
  Астрахань: [
    {
      orgname:
        "ГКУ Астраханской Области «Социальный центр кризисной реабилитации женщин»",
    },
  ],
  Трубчевск: [{ orgname: "ГБУ «КЦСОН Трубчевского района»" }],
  "Гусь-Хрустальный": [
    {
      orgname:
        "ГКУСО Владимирской области «Гусь-Хрустальный социально-реабилитационный центр для несовершеннолетних»",
    },
  ],
  Владимир: [
    {
      orgname:
        "ГБУСО ВО Владимирский комплексный центр социального обслуживания населения, Отделение помощи женщинам, оказавшимся в трудной жизненной ситуации",
    },
  ],
  Волгоград: [
    {
      orgname:
        'ГБУСО «Волгоградский областной центр социальной помощи семье и детям "Семья"»',
    },
    {
      orgname:
        "Волгоградское региональное общественное учреждение «Кризисно-конфликтный центр»",
    },
  ],
  Бабаево: [
    {
      orgname:
        "Автономная некомерческая организация «Кризисный центр для лиц, находящихся в трудной жизненной ситуации г.Бабаево»",
    },
  ],
  Череповец: [
    {
      orgname:
        'Некоммерческое Партнерство «Межведомственная служба помощи детям и молодежи "Восхождение"»',
    },
  ],
  Воронеж: [
    {
      orgname:
        'Казенное учреждение Воронежской области «Областной центр социальной помощи семье и детям "Буревестник"»',
    },
    {
      orgname:
        'Воронежская общественная организация «Воронежский городской форум независимой женской демократической инициативы ("НеЖДИ")»',
    },
  ],
  Иркутск: [
    {
      orgname:
        "Иркутская городская некоммерческая общественная организация «Кризисный центр для женщин»",
    },
    { orgname: "Кризисный центр для женщин «Мария»" },
    {
      orgname:
        "Благотворительный общественный Фонд Иркутской области «ОберегЪ»",
    },
    { orgname: "Кризисный центр для женщин" },
  ],
  Шелехов: [
    { orgname: "Шелеховский общественный благотворительный фонд «Гармония»" },
  ],
  Калининград: [
    {
      orgname:
        "Кризисный центр для беременных женщин и женщин с детьми «Обитель» (действует при поддержке Синодального отдела по церковной благотворительности и социальному служению Русской Православной Церкви)",
    },
  ],
  Пионерский: [
    {
      orgname:
        "ГАУ Калининградской Области «Областной Кризисный Центр Помощи Женщинам»",
    },
  ],
  "Барятинский район, село Барятино": [
    {
      orgname:
        'Филиал ГБУ Калужской области «Центр социальной помощи семье и детям "Чайка" "Надежда"»',
    },
  ],
  "Жиздринский район, д. Мужитино": [
    {
      orgname:
        'Филиал ГБУ Калужской области «Центр социальной помощи семье и детям "Чайка" "Русич"»',
    },
  ],
  "Куйбышевский район, с. пос. Село Бутчино, д. Ветьмица": [
    {
      orgname:
        'Филиал ГБУ Калужской области «Центр социальной помощи семье и детям "Чайка" "Берегиня"»',
    },
  ],
  Людиново: [
    {
      orgname:
        "ГБУ Калужской области Центр социальной помощи семье и детям «Чайка»",
    },
  ],
  "Петропавловск-Камчатский": [
    { orgname: "Кризисный центр для женщин «Надежда»" },
  ],
  Кемерово: [
    {
      orgname:
        "МБУ «Комплексный центр социального обслуживания населения Центрального района города Кемерово»",
    },
  ],
  Киров: [
    {
      orgname:
        "Приют «Вифлеем в Вятке«» (Центр для беременных женщин, оказавшихся в сложной жизненной ситуации)",
    },
  ],
  Кострома: [
    {
      orgname:
        "ГКУ «Костромской областной Центр социальной помощи семье и детям»",
    },
  ],
  Армавир: [
    {
      orgname:
        "Краснодарская краевая правозащитная общественная организация «Правое дело»",
    },
  ],
  Белореченск: [{ orgname: "Белореченская ГОО «Мир Детства»" }],
  Краснодар: [
    {
      orgname:
        "ГБУСО Краснодарского края «Краснодарский краевой кризисный центр помощи женщинам»",
    },
  ],
  "Тбилисский район, станица Тбилисская": [
    { orgname: "Общественное движение женщин Тбилисского района «Надежда»" },
  ],
  Сочи: [
    {
      orgname:
        "Обеспечение временного приюта кризисным беременным и женщинам с детьми, попавшими в трудную жизненную ситуацию",
    },
  ],
  Красноярск: [
    {
      orgname:
        'Красноярская РОО «Кризисный центр для женщин и их семей, подвергшихся насилию "Верба"»',
    },
    {
      orgname:
        'МБУ «Городской Центр Социального Обслуживания Населения "Родник"»',
    },
    {
      orgname:
        '«Кризисный центр для женщин и их семей, подвергшихся насилию "Верба"»',
    },
  ],
  Норильск: [
    {
      orgname:
        "МБУ «КЦСОН МО города Норильска», отделение психолого-педагогической помощи детям, семьям, женщинам, оказавшимся в трудной жизненной ситуации",
    },
  ],
  Курган: [
    {
      orgname:
        "ГБУ «Курганский центр социальной помощи семье и детям», Кризисное отделение «Время перемен»",
    },
  ],
  "Санкт-Петербург": [
    {
      orgname:
        'Санкт-Петербургское ГБУ «Кризисный центр помощи женщинам», отделение социальной реабилитации "Маленькая Мама"',
    },
    {
      orgname:
        "Санкт-Петербургское ГУ «Территориальный центр социальной помощи семье и детям»",
    },
    { orgname: "Санкт-Петербургская РОО ИНГО Кризисный центр для женщин" },
    {
      orgname:
        "Автономная некоммерческая организация по оказанию социальных услуг «Мужчины ХХI века»",
    },
    {
      orgname:
        "АНО Центр поддержки детства и материнства в кризисных ситуациях «Свет Надежды»",
    },
    {
      orgname:
        "РОО социальных проектов в сфере благополучия населения «Стеллит»",
    },
    {
      orgname:
        "СПб ОО «Служба социально юридической помощи пострадавшим от насилия»",
    },
    {
      orgname:
        'Санкт-Петербургская ОО по гармоничному развитию семьи и личности «Центр "Радомира"»',
    },
    {
      orgname:
        "Учреждение «Центр социальной помощи семье и детям Адмиралтейского района Санкт-Петербурга»",
    },
    {
      orgname:
        "ГБУ «Центр социальной помощи семье и детям Василеостровского района»",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Центр социальной помощи семье и детям Выборгского района Санкт-Петербурга»",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Центр социальной помощи семье и детям Кировского района Санкт-Петербурга»",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Центр социальной помощи семье и детям Калининского района»",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Комплексный центр социального обслуживания населения Красносельского района»",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Комплексный центр социального обслуживания населения Курортного района»",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Центр социальной помощи семье и детям Красногвардейского района Санкт-Петербурга», Отделение помощи женщинам, оказавшимся в трудной жизненной ситуации «Охта»",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Центр социальной помощи семье и детям Московского района»",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Центр социальной помощи семье и детям Невского района Санкт–Петербурга»",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Центр Социальной Помощи Семье и Детям Петроградского Района»",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Центр социальной помощи семье и детям Петродворцового района Санкт-Петербурга»",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Центр Социальной Помощи Семье и Детям Приморского Района»",
    },
    {
      orgname:
        'Санкт-Петербургское ГБУ «Центр Социальной Помощи Семье и Детям Пушкинского района "Аист"»',
    },
    {
      orgname:
        "Санкт-Петербургская БОО поддержки социальных инициатив «Содействие»",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Центр Социальной Помощи Семье и Детям Фрунзенского Района»",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Центр Социальной Помощи Семье и Детям Центрального района»",
    },
  ],
  Липецк: [
    { orgname: "ОКУ «Кризисный центр помощи женщинам и детям г. Липецк»" },
  ],
  Магадан: [
    {
      orgname:
        "Отдел социальной помощи семье и детям Магаданского социального центра",
    },
  ],
  Москва: [
    { orgname: "Консорциум женских неправительственных объединений" },
    { orgname: "Национальный центр по предотвращению насилия «Анна»" },
    {
      orgname:
        "Независимый благотворительный Центр помощи пережившим сексуальное насилие «Сестры»",
    },
    { orgname: "Благотворительный Фонд «Женщины и дети прежде всего»" },
    {
      orgname:
        "ГБУ г. Москвы Центр социальной помощи семье и детям «Благополучие»",
    },
    { orgname: "Благотворительный фонд «Безопасный дом»" },
    {
      orgname:
        "ГБУ города Москвы Центр социальной помощи семье и детям «Гелиос», отделение помощи женщинам, оказавшимся в кризисной ситуации",
    },
    {
      orgname: "Филиал «Надежда» ГБУ «Кризисный центр помощи женщинам и детям»",
    },
    { orgname: "Кризисный центр «Дом для мамы»" },
    {
      orgname:
        "АНО «Центр помощи семьям, находящимся в трудной жизненной ситуации “Китеж”»",
    },
    {
      orgname:
        "Филиал «Специализированный дом ребенка» ГБУ «Кризисный центр помощи женщинам и детям»",
    },
    {
      orgname:
        "Центр психологической помощи Pro Bono «Школа антикризисного реагирования» (ШАР)",
    },
    { orgname: "ГБУ «Кризисный центр помощи женщинам и детям»" },
    { orgname: "Благотворительный фонд «Насилию.нет»" },
  ],
  Дмитров: [
    {
      orgname:
        "Дмитровский центр социальной помощи семье и детям; отделение помощи женщинам, оказавшимся в трудной жизненной ситуации",
    },
  ],
  Дубна: [
    { orgname: "ННО Женский информационно-образовательный центр «Стимула»" },
  ],
  "г.о. Кашира, д. Лиды": [
    {
      orgname:
        'ГКУСО Московской области «Каширский специализированный социально-реабилитационный центр для несовершеннолетних "Семья"»',
    },
  ],
  Клин: [
    {
      orgname:
        'ГБУСО Московской области «Клинский центр социальной помощи семье и детям "Семья"»',
    },
  ],
  Щёлково: [
    {
      orgname:
        'ГБУСО Московской области «Щёлковский центр психолого-педагогической помощи населению "Янтарь"»',
    },
  ],
  Апатиты: [
    {
      orgname:
        "ГОАУСО Отделение для несовершеннолетних нуждающихся в социальной реабилитации",
    },
  ],
  Мурманск: [
    { orgname: "ГОБУСОН «Мурманский центр социальной помощи семье и детям»" },
  ],
  Арзамас: [{ orgname: "Центр социальной помощи семье и детям г. Арзамаса" }],
  Балахна: [
    {
      orgname:
        "ГБУ «Центр социальной помощи семье и детям ”Гармония” Балахнинского района»",
    },
  ],
  Городец: [
    {
      orgname: "ГБУ «Центр социальной помощи семье и детям Городецкого района»",
    },
    { orgname: "Нижегородская РОО «Кризисный центр Александра»" },
  ],
  "Нижний Новгород": [{ orgname: "Нижегородский Женский Кризисный Центр" }],
  Чкаловск: [
    {
      orgname:
        "ГБУ «Комплексный центр социального обслуживания населения Чкаловского района»",
    },
  ],
  "Великий Новгород": [
    { orgname: "ОБУСО «Кризисный центр помощи женщинам»" },
    { orgname: "РОО «Новгородский Гендерный центр»" },
  ],
  Новосибирск: [
    {
      orgname:
        "Новосибирское областное общественное объединение Женское Инициативное Творческое Объединение «Служба семьи Новосибирска»",
    },
  ],
  Омск: [
    {
      orgname:
        'Омская РОО «Центр охраны здоровья и социальной защиты "Сибальт"»',
    },
    {
      orgname:
        "Бюджетное учреждение Омской области «Центр социальной помощи семье и детям (с социальной гостиницей)»",
    },
  ],
  Орёл: [
    {
      orgname:
        'БУ Орловской обл. «Кризисный центр помощи женщинам и детям "Орловский"\\»',
    },
  ],
  Пенза: [
    {
      orgname:
        "Кризисный центр по оказанию помощи женщинам и детям, оказавшимся в трудной жизненной ситуации",
    },
  ],
  Пермь: [{ orgname: "КГАУ «Центр социальной адаптации»" }],
  Владивосток: [
    {
      orgname:
        "АНО «Дальневосточный центр развития гражданских инициатив и социального партнерства»",
    },
    { orgname: "КГАУСО «Приморский центр социального обслуживания населения»" },
    {
      orgname:
        "Кризисный центр «Ирис» (при Владивостокском городском Совете женщин)",
    },
  ],
  Псков: [
    {
      orgname:
        "Псковская областная общественная организация «Независимый социальный женский центр»",
    },
  ],
  Майкоп: [{ orgname: "Центр по профилактике домашнего насилия «Фемина»" }],
  Уфа: [
    {
      orgname:
        "КЦСОН «Изгелек» Кировского района городского округа город Уфа Республики Башкортостан",
    },
  ],
  Северобайкальск: [
    {
      orgname:
        'ГУСО «Социально-реабилитационный центр для несовершеннолетних "Надежда"»',
    },
  ],
  "Улан-Удэ": [{ orgname: "Центр социальной помощи для семей с детьми" }],
  Каспийск: [
    { orgname: "Дагестанская РОО Психологов и Социальных Работников «Психея»" },
  ],
  Кизляр: [{ orgname: "РОО «Твори добро»" }],
  Махачкала: [
    { orgname: "РОО «Мать и Дитя»" },
    { orgname: "СО ДРОО «Октава»" },
    { orgname: "Общественное движение «Дагестан без сирот»" },
    { orgname: "Центр защиты материнства и детства АНО «Теплый дом на горе»" },
  ],
  Хасавюрт: [{ orgname: "ДРОБО «Материнский очаг»" }],
  Петрозаводск: [
    {
      orgname:
        'Государственного бюджетного учреждения социального обслуживания Республики Карелия «Республиканский центр социальной помощи семье и детям "Сампо"»',
    },
    {
      orgname:
        "МБУСО Петрозаводского городского округа Комплексный центр социального обслуживания населения «Истоки»",
    },
    { orgname: "РОО «Карельский центр гендерных исследований»" },
  ],
  "Сортавальское гор.пос. Сортавала": [
    {
      orgname:
        "МБУ «Комплексный Центр социального обслуживания населения» Сортавальского муниципального района, отделение помощи женщинам, оказавшимся в трудной жизненной ситуации",
    },
  ],
  Сыктывкар: [
    {
      orgname:
        "ГБУ Республики Коми «Центр по предоставлению государственных услуг в сфере социальной защиты населения города Сыктывкара»",
    },
  ],
  Ухта: [
    {
      orgname:
        "ГБУ Республики Коми «Центр социальной помощи семье и детям города Ухты»",
    },
  ],
  Саранск: [
    {
      orgname:
        "Мордовской республиканский клинический перинатальный центр кризисный центр для женщин",
    },
  ],
  Якутск: [
    {
      orgname:
        "Центр социально-психологической поддержки семьи и молодежи Республики Саха",
    },
  ],
  Казань: [
    {
      orgname:
        'ГАУСО «Республиканский информационно-методический центр социальной помощи семье и детям "Гаиле"»',
    },
    { orgname: "Женский кризисный центр «Фатима»" },
    { orgname: "ТРОО Деловые женщины Татарстана" },
    {
      orgname:
        "Всемирный Татарский конгресс; Всемирная татарская женская организация",
    },
  ],
  Азов: [
    {
      orgname:
        "ГБУСОН Ростовской обл. «Центр социальной помощи семье и детям – Дом семьи г. Азов»",
    },
  ],
  "Ростов-на-Дону": [
    {
      orgname:
        "ГБУСОН Ростовской обл. «Азовский детский дом-интернат для умственно отсталых детей»",
    },
    { orgname: "" },
    { orgname: "АНО «Региональный ресурсный центр по профилактике насилия»" },
  ],
  "Азовский район, село Кулешовка": [
    {
      orgname:
        "ГУСОН Ростовской обл. «Социально-реабилитационный центр для несовершеннолетних Азовского района»",
    },
  ],
  Батайск: [
    {
      orgname:
        "ГБУСОН Ростовской области «Социальный приют для детей и подростков г. Батайска»",
    },
  ],
  "Белая Калитва": [
    {
      orgname:
        "ГБУСОН Ростовской области «Социально-реабилитационный центр для несовершеннолетних Белокалитвинского района»",
    },
  ],
  "Шолоховский район, станица Вешенская": [
    {
      orgname:
        "ГБУСОН Ростовской обл. «Центр Психолого-педагогической Помощи Населению СТ. Вешенской Шолоховского района»",
    },
  ],
  Волгодонск: [
    { orgname: "АНО Региональный Ресурсный центр «Здоровая семья»" },
  ],
  Гуково: [
    {
      orgname:
        "ГБУСОН Ростовской области «Социально-реабилитационный центр для несовершеннолетних г. Гуково»",
    },
  ],
  Донецк: [
    { orgname: "ГБУСОН РО «Центр социальной помощи семье и детям г. Донецка»" },
  ],
  "Егорлыкский район, станица Егорлыкская": [
    {
      orgname:
        "ГБУСОН Ростовской области «Социально-реабилитационный центр для несовершеннолетних Егорлыкского района»",
    },
  ],
  Зерноград: [
    {
      orgname:
        "ГБУСОН Ростовской области. «Социально-реабилитационный центр для несовершеннолетних Зерноградского района»",
    },
  ],
  "Каменский район, пос. Чистоозерный": [
    {
      orgname:
        "ГБУСОН Ростовской обл. «Реабилитационный центр для детей и подростков с ограниченными возможностями Каменского района»",
    },
  ],
  "Красный Сулин": [
    {
      orgname:
        "ГБУСОН Ростовской области «Социально-реабилитационный центр для несовершеннолетних г. Красного Сулина»",
    },
  ],
  "Куйбышевский р-н, с. Куйбышево": [
    {
      orgname:
        "ГБУСОН Ростовской области «Социально-реабилитационный центр для несовершеннолетних Куйбышевского района»",
    },
  ],
  "Песчанокопский р-н, с. Песчанокопское": [
    {
      orgname:
        "ГУ Ростовской Области «Центр социальной помощи семье и детям г. Ростова-на-Дону»",
    },
  ],
  Сальск: [
    {
      orgname:
        "ГБУСОН Ростовской области «Социально –реабилитационный центр для несовершеннолетних Сальского района»",
    },
  ],
  Семикаракорск: [
    {
      orgname:
        "ГБУСОН Ростовской области «Центр социальной помощи семье и детям Семикаракорского района»",
    },
  ],
  "Советский район, ст. Советская": [
    {
      orgname:
        "ГБУСОН Ростовской обл. «Центр социальной помощи семье и детям Советского района»",
    },
  ],
  Таганрог: [{ orgname: "УСЗН г.Таганрога" }],
  "Тацинский район, пос. Быстрогорский": [
    {
      orgname:
        "ГБУСОН Ростовской области «Социально-реабилитационный центр для несовершеннолетних Тацинского района»",
    },
  ],
  Шахты: [
    {
      orgname:
        'ГБУСОН Ростовской области «Реабилитационный центр "Добродея" для детей и подростков с ограниченными возможностями: дефектами умственного и физического развития г. Шахты»',
    },
    {
      orgname:
        "ГБУСОН Ростовской области «Социально-реабилитационный центр для несовершеннолетних г. Шахты»",
    },
  ],
  Тольятти: [
    { orgname: "АНО «Открытая Альтернатива»" },
    {
      orgname:
        'ГКУ Самарской области «Тольяттинский социальный приют для детей и подростков "Дельфин" (с кризисным отделением для женщин)»',
    },
  ],
  Самара: [
    {
      orgname:
        "Проект «Знание остановит гендерное насилие: поиск новых решений»",
    },
    { orgname: "Знание остановит гендерное насилие: поиск новых решений" },
  ],
  Балаково: [
    {
      orgname:
        'ГБУ Саратовской обл. «Балаковский центр социальной помощи семье и детям "Семья"»',
    },
  ],
  Вольск: [
    {
      orgname:
        'ГБУ Саратовской области «Социально-реабилитационный центр для несовершеннолетних "Волжанка"»',
    },
  ],
  Красноармейск: [
    {
      orgname:
        'Государственное бюджетное учреждение Саратовской области «Красноармейский центр социальной помощи семье и детям "Семья"»',
    },
  ],
  Саратов: [
    {
      orgname:
        "ГБУ Саратовской области «Центр социальной помощи семье и детям г. Саратова»",
    },
  ],
  Энгельс: [
    {
      orgname:
        'ГАУ Саратовской области «Энгельсский центр социальной помощи семье и детям "Семья"»',
    },
    {
      orgname:
        'ГБУ Саратовской области «Красноармейский центр социальной помощи семье и детям "Семья"»',
    },
  ],
  Хвалынск: [
    { orgname: "ОГУ «Хвалынскиий центр социальной помощи семье и детям»" },
  ],
  "Южно-Сахалинск": [{ orgname: "Благотворительный фонд «Радость жизни»" }],
  "Артёмовский г.о., пгт Буланаш": [
    {
      orgname:
        "ГБУСОН Свердловской области «Центр социальной помощи семье и детям Артемовского района»",
    },
  ],
  Богданович: [
    {
      orgname:
        "ГАУСОН Свердловской области «Центр социальной помощи семье и детям города Богдановича»",
    },
  ],
  Екатеринбург: [
    {
      orgname:
        "Свердловская региональная общественная организация «Женский юрист»",
    },
    {
      orgname:
        'Свердловская региональная общественная организация «Кризисный центр для женщин и детей, переживших насилие в семье "Екатерина"»',
    },
    { orgname: "Некоммерческое партнерство «Семья детям»" },
    {
      orgname:
        'ГБУСОН Свердловской области «Центр социальной помощи семье и детям "Гнездышко" Кировского района города Екатеринбурга»',
    },
    {
      orgname:
        'ГБУ «КЦСОН "Малахит" Орджоникидзевского района города Екатеринбурга»',
    },
  ],
  "Каменск-Уральский": [
    {
      orgname:
        "Комплексный центр социального обслуживания населения города Каменска-Уральского",
    },
  ],
  "Каменск-Уральский, пос. Трубный": [
    {
      orgname:
        "Социально-реабилитационный центр для несовершеннолетних «Лада» г. Каменск-Уральский",
    },
  ],
  "Нижний Тагил": [
    { orgname: "АНО «Центр семейной терапии и консультирования»" },
    { orgname: "Центр социальной помощи семье и детям «Рябинушка»" },
    { orgname: "АНО «Центр семейной терапии и консультирования»" },
  ],
  "Нижняя Тура": [
    {
      orgname:
        "Центр социальной помощи семье и детям г. Нижняя Тура, кризисное отделение для женщин, оказавшихся в трудной жизненной ситуации",
    },
  ],
  Полевской: [
    { orgname: "Центр социальной помощи семье и детям города Полевского" },
  ],
  Ревда: [
    {
      orgname:
        "Социально-реабилитационный центр Ревдинского района; отделение помощи женщинам, оказавшимся в трудной жизненной ситуации",
    },
  ],
  Тавда: [
    {
      orgname:
        "Социально-реабилитационный центр для несовершеннолетних Тавдинского района «Золушка»",
    },
  ],
  Смоленск: [{ orgname: "МОО «Центр социальной поддержки женщин»" }],
  Ставрополь: [
    { orgname: "ГБУСО «Ставропольский центр социальной помощи семье и детям»" },
  ],
  Ессентуки: [{ orgname: "АНО «Дом для мамы»" }],
  Томск: [
    {
      orgname:
        "Служба «Кризисный центр для женщин» муниципального учреждения профилактики и социальной адаптации «Семья» г. Томска",
    },
  ],
  Тула: [
    { orgname: "ГУСОН Тульской области «Кризисный центр помощи женщинам»" },
  ],
  Тюмень: [
    {
      orgname:
        "АУ Тюменской области дополнительного профессионального образования и развития социальных технологий «Семья»",
    },
    {
      orgname:
        "АУ Тюменской области дополнительного профессионального образования и развития социальных технологий «Семья»",
    },
  ],
  Ижевск: [
    {
      orgname:
        'Региональная общественная организация Удмуртской Республики «Центр поддержки семьи и детей "Теплый дом"»',
    },
    {
      orgname:
        "БУ центр социальной помощи семье и детям Октябрьского района г. Ижевска",
    },
    { orgname: "КЦСОН Ленинского района г.Ижевска" },
  ],
  Ульяновск: [
    {
      orgname:
        'ОГКУСО «Центр социально-психологической помощи семье и детям "Семья"»',
    },
  ],
  "Комсомольск-на-Амуре": [
    {
      orgname:
        "Отделение помощи женщинам, оказавшимся в трудной жизненной ситуации",
    },
  ],
  Хабаровск: [
    {
      orgname:
        "Отделение помощи женщинам, оказавшимся в трудной жизненной ситуации",
    },
    {
      orgname:
        "НЕ ОДНА — кризисный центр для женщин краевой общественной организации «Милосердие»",
    },
  ],
  Нефтеюганск: [
    { orgname: "БУ ХМАО-Югры Центр социальной помощи семье и детям «Веста»" },
  ],
  Нижневартовск: [
    {
      orgname:
        'БУ ХМАО – Югры «Центр социальной помощи семье и детям "Кардея"»',
    },
    { orgname: "Кризисный центр «Надежный дом»" },
    {
      orgname:
        "Отделение помощи женщинам, оказавшимся в трудной жизненной ситуации",
    },
  ],
  Челябинск: [
    { orgname: "АНО «Обитель»" },
    { orgname: 'МБУ «Центр профилактического сопровождения "Компас"»' },
    { orgname: "МУСО «Кризисный центр» г. Челябинска" },
    {
      orgname:
        'АНО «Центр социальной поддержки семей, находящихся в трудной жизненной ситуации "Возможность"»',
    },
  ],
  Грозный: [
    { orgname: "АНО «Женщины за развитие»" },
    {
      orgname:
        "Чеченская РОО Ресурсный социально – психологический центр «Синтем – Успокоение души»",
    },
    {
      orgname:
        "Чеченская Региональная Правозащитная Общественная Организация «Нийсо» (Справедливость)",
    },
    { orgname: "Чеченская РОО Информационно-правовой центр «Элиф»" },
    {
      orgname:
        "Межрегиональное движение в защиту прав и свобод человека «Коалиция»",
    },
  ],
  Чебоксары: [
    {
      orgname:
        "БУ «Социально-реабилитационный центр для несовершеннолетних г. Чебоксары» Минздравсоцразвития Чувашии",
    },
  ],
  Салехард: [
    {
      orgname:
        'ГКУ ЯНАО «Социально-реабилитационный центр для несовершеннолетних "Доверие" г. Салехард»',
    },
  ],
  "Пуровский р-н, Тарко-Сале": [
    {
      orgname:
        "ГБУ «Центр социального обслуживания населения в мо Пуровский район», Отделение помощи гражданам, оказавшимся в трудной жизненной ситуации",
    },
  ],
  "Новый Уренгой": [
    {
      orgname:
        'Государственное бюджетное учреждение ЯНАО «Центр социальной помощи семье и детям "Садко"»',
    },
  ],
  Рыбинск: [{ orgname: 'Некоммерческое партнерство «Центр семьи "Ариадна"»' }],
};

var SELECTED_CITY = undefined;
var SELECTED_ITEM = undefined;

var cities = [
  { name: "Сыктывкар", value: "Сыктывкар" },
  { name: "Дубна", value: "Дубна" },
  { name: "Людиново", value: "Людиново" },
  { name: "Владимир", value: "Владимир" },
  { name: "Дмитров", value: "Дмитров" },
  { name: "Смоленск", value: "Смоленск" },
  { name: "Уфа", value: "Уфа" },
  { name: "Мурманск", value: "Мурманск" },
  { name: "Арзамас", value: "Арзамас" },
  { name: "Пермь", value: "Пермь" },
  { name: "Петропавловск-Камчатский", value: "Петропавловск-Камчатский" },
  { name: "Магадан", value: "Магадан" },
  { name: "Саранск", value: "Саранск" },
  { name: "Балаково", value: "Балаково" },
  { name: "Город", value: "Город" },
  { name: "Петрозаводск", value: "Петрозаводск" },
  { name: "Ульяновск", value: "Ульяновск" },
  { name: "Красноармейск", value: "Красноармейск" },
  { name: "Грозный", value: "Грозный" },
  { name: "Армавир", value: "Армавир" },
  { name: "Бабаево", value: "Бабаево" },
  { name: "Сочи", value: "Сочи" },
  { name: "Якутск", value: "Якутск" },
  { name: "Красный Сулин", value: "Красный Сулин" },
  { name: "Хвалынск", value: "Хвалынск" },
  { name: "Кизляр", value: "Кизляр" },
  { name: "Северодвинск", value: "Северодвинск" },
  { name: "Салехард", value: "Салехард" },
  { name: "Богданович", value: "Богданович" },
  { name: "Иркутск", value: "Иркутск" },
  { name: "Нижняя Тура", value: "Нижняя Тура" },
  { name: "Комсомольск-на-Амуре", value: "Комсомольск-на-Амуре" },
  { name: "Челябинск", value: "Челябинск" },
  {
    name: "Каменск-Уральский, пос. Трубный",
    value: "Каменск-Уральский, пос. Трубный",
  },
  { name: "Щёлково", value: "Щёлково" },
  { name: "Чебоксары", value: "Чебоксары" },
  { name: "Астрахань", value: "Астрахань" },
  { name: "Новосибирск", value: "Новосибирск" },
  { name: "Пионерский", value: "Пионерский" },
  {
    name: "Тацинский район, пос. Быстрогорский",
    value: "Тацинский район, пос. Быстрогорский",
  },
  { name: "Гусь-Хрустальный", value: "Гусь-Хрустальный" },
  { name: "Белая Калитва", value: "Белая Калитва" },
  {
    name: "Куйбышевский р-н, с. Куйбышево",
    value: "Куйбышевский р-н, с. Куйбышево",
  },
  {
    name: "Тбилисский район, станица Тбилисская",
    value: "Тбилисский район, станица Тбилисская",
  },
  { name: "Чкаловск", value: "Чкаловск" },
  { name: "Красноярск", value: "Красноярск" },
  { name: "Энгельс", value: "Энгельс" },
  { name: "Саратов", value: "Саратов" },
  { name: "Батайск", value: "Батайск" },
  { name: "Ставрополь", value: "Ставрополь" },
  {
    name: "Жиздринский район, д. Мужитино",
    value: "Жиздринский район, д. Мужитино",
  },
  {
    name: "Шолоховский район, станица Вешенская",
    value: "Шолоховский район, станица Вешенская",
  },
  { name: "Каспийск", value: "Каспийск" },
  { name: "Хасавюрт", value: "Хасавюрт" },
  { name: "Нижний Тагил", value: "Нижний Тагил" },
  { name: "Киров", value: "Киров" },
  { name: "Липецк", value: "Липецк" },
  { name: "Шахты", value: "Шахты" },
  { name: "Томск", value: "Томск" },
  { name: "Ревда", value: "Ревда" },
  { name: "Казань", value: "Казань" },
  {
    name: "Куйбышевский район, с. пос. Село Бутчино, д. Ветьмица",
    value: "Куйбышевский район, с. пос. Село Бутчино, д. Ветьмица",
  },
  { name: "Каменск-Уральский", value: "Каменск-Уральский" },
  { name: "г.о. Кашира, д. Лиды", value: "г.о. Кашира, д. Лиды" },
  { name: "Санкт-Петербург", value: "Санкт-Петербург" },
  { name: "Омск", value: "Омск" },
  { name: "Семикаракорск", value: "Семикаракорск" },
  { name: "Краснодар", value: "Краснодар" },
  { name: "Норильск", value: "Норильск" },
  { name: "Ухта", value: "Ухта" },
  { name: "Хабаровск", value: "Хабаровск" },
  { name: "Ростов-на-Дону", value: "Ростов-на-Дону" },
  { name: "Донецк", value: "Донецк" },
  { name: "Таганрог", value: "Таганрог" },
  { name: "Пенза", value: "Пенза" },
  { name: "Тула", value: "Тула" },
  { name: "Майкоп", value: "Майкоп" },
  { name: "Пуровский р-н, Тарко-Сале", value: "Пуровский р-н, Тарко-Сале" },
  { name: "Владивосток", value: "Владивосток" },
  { name: "Новый Уренгой", value: "Новый Уренгой" },
  { name: "Волгодонск", value: "Волгодонск" },
  { name: "Зерноград", value: "Зерноград" },
  { name: "Калининград", value: "Калининград" },
  { name: "Улан-Удэ", value: "Улан-Удэ" },
  { name: "Волгоград", value: "Волгоград" },
  {
    name: "Егорлыкский район, станица Егорлыкская",
    value: "Егорлыкский район, станица Егорлыкская",
  },
  { name: "Нижневартовск", value: "Нижневартовск" },
  { name: "Нижний Новгород", value: "Нижний Новгород" },
  {
    name: "Советский район, ст. Советская",
    value: "Советский район, ст. Советская",
  },
  { name: "Кемерово", value: "Кемерово" },
  { name: "Великий Новгород", value: "Великий Новгород" },
  { name: "Махачкала", value: "Махачкала" },
  { name: "Южно-Сахалинск", value: "Южно-Сахалинск" },
  { name: "Воронеж", value: "Воронеж" },
  { name: "Белореченск", value: "Белореченск" },
  { name: "Городец", value: "Городец" },
  { name: "Псков", value: "Псков" },
  { name: "Вольск", value: "Вольск" },
  { name: "Нефтеюганск", value: "Нефтеюганск" },
  { name: "Архангельск", value: "Архангельск" },
  { name: "Тольятти", value: "Тольятти" },
  { name: "Полевской", value: "Полевской" },
  { name: "Кострома", value: "Кострома" },
  { name: "Трубчевск", value: "Трубчевск" },
  { name: "Ижевск", value: "Ижевск" },
  { name: "Тавда", value: "Тавда" },
  { name: "Барнаул", value: "Барнаул" },
  { name: "Гуково", value: "Гуково" },
  { name: "Рыбинск", value: "Рыбинск" },
  { name: "Сальск", value: "Сальск" },
  { name: "Апатиты", value: "Апатиты" },
  { name: "Балахна", value: "Балахна" },
  {
    name: "Азовский район, село Кулешовка",
    value: "Азовский район, село Кулешовка",
  },
  { name: "Москва", value: "Москва" },
  { name: "Череповец", value: "Череповец" },
  { name: "Ессентуки", value: "Ессентуки" },
  {
    name: "Каменский район, пос. Чистоозерный",
    value: "Каменский район, пос. Чистоозерный",
  },
  { name: "Орёл", value: "Орёл" },
  { name: "Екатеринбург", value: "Екатеринбург" },
  { name: "Шелехов", value: "Шелехов" },
  {
    name: "Сортавальское гор.пос. Сортавала",
    value: "Сортавальское гор.пос. Сортавала",
  },
  {
    name: "Песчанокопский р-н, с. Песчанокопское",
    value: "Песчанокопский р-н, с. Песчанокопское",
  },
  {
    name: "Барятинский район, село Барятино",
    value: "Барятинский район, село Барятино",
  },
  { name: "Клин", value: "Клин" },
  { name: "Северобайкальск", value: "Северобайкальск" },
  { name: "Самара", value: "Самара" },
  {
    name: "Артёмовский г.о., пгт Буланаш",
    value: "Артёмовский г.о., пгт Буланаш",
  },
  { name: "Курган", value: "Курган" },
  { name: "Азов", value: "Азов" },
  { name: "Тюмень", value: "Тюмень" },
];

function redrawSelectedCenter(selected) {
  if (DATA[SELECTED_CITY] == undefined) {
    console.error("no", SELECTED_CITY, "in centers list");
    return;
  }

  var centers = DATA[SELECTED_CITY];

  if (selected === undefined) {
    SELECTED_ITEM = Math.floor(Math.random() * centers.length);
  } else {
    SELECTED_ITEM = selected;
  }
  console.log(`${SELECTED_CITY}_${SELECTED_ITEM}`);

  var x = "";
  centers.forEach((element, i) => {
    if (i == SELECTED_ITEM) {
      x += `<div class="link item active"><i class="check icon"></i><b>${element.orgname}</b></div>`;
    } else {
      x += `<div class="link item" onclick="redrawSelectedCenter(${i})">${element.orgname}</div>`;
    }
  });

  $("#centers_list").html(x);

  $("#download_button").attr("href", `./${SELECTED_CITY}_${SELECTED_ITEM}.pdf`);
  $("#download_button").removeClass("disabled");
  $("#centers_list_parent").removeClass("m_hidden");
}

function buildCityList() {
  console.log(`${SELECTED_CITY}_${SELECTED_ITEM}`);

  $("#city_dropdown").dropdown({
    placeholder: "Город",
    values: cities,
    onChange: function (text, value, element) {
      if (value === undefined || value === SELECTED_CITY) return;
      SELECTED_CITY = value;
      console.log(`${SELECTED_CITY}_${SELECTED_ITEM}`);
      redrawSelectedCenter(undefined);
    },
  });
}

function showModalBySelector(selector) {
  $(selector).modal({ inverted: true }).modal("show");
}

function closeModals() {
  $(".ui.modal").modal("hide");
}

$(document).ready(function () {
  setInterval(function () {
    var cnt = Math.floor(Math.random() * 2000) + 1;
    var cnt_description = "объявлений";

    if (cnt % 100 >= 10 && cnt % 100 < 20) {
      //
    } else if (cnt % 10 == 1) {
      cnt_description = "объявление";
    } else if (cnt % 10 == 2 || cnt % 10 == 3 || cnt % 10 == 4) {
      cnt_description = "объявления";
    }

    document.getElementById("download_counter_number").innerText = cnt;
    document.getElementById(
      "download_counter_descriptor"
    ).innerText = cnt_description;
  }, 2000);

  buildCityList();
});
