var DATA = {
  Барнаул: [
    {
      orgname: "КГБУСО «Краевой Кризисный Центр для Женщин»",
      filename: "2.pdf",
    },
    {
      orgname:
        "Алтайская региональная общественная организация по предотвращению насилия «Право на счастье»",
      filename: "3.pdf",
    },
  ],
  Архангельск: [
    {
      orgname: "ГБУ Архангельской области Центр реабилитации «Родник»",
      filename: "4.pdf",
    },
    {
      orgname:
        'Архангельская Региональная Общественная Организация «Кризисный центр "Надежда"»',
      filename: "5.pdf",
    },
  ],
  Северодвинск: [
    {
      orgname:
        "МБОУ для детей, нуждающихся в психолого-педагогической и медико-социальной помощи «Центр диагностики и консультирования»",
      filename: "6.pdf",
    },
  ],
  Астрахань: [
    {
      orgname:
        "ГКУ Астраханской Области «Социальный центр кризисной реабилитации женщин»",
      filename: "7.pdf",
    },
  ],
  Трубчевск: [
    { orgname: "ГБУ «КЦСОН Трубчевского района»", filename: "8.pdf" },
  ],
  "Гусь-Хрустальный": [
    {
      orgname:
        "ГКУСО Владимирской области «Гусь-Хрустальный социально-реабилитационный центр для несовершеннолетних»",
      filename: "9.pdf",
    },
  ],
  Владимир: [
    {
      orgname:
        "ГБУСО ВО Владимирский комплексный центр социального обслуживания населения, Отделение помощи женщинам, оказавшимся в трудной жизненной ситуации",
      filename: "10.pdf",
    },
  ],
  Волгоград: [
    {
      orgname:
        'ГБУСО «Волгоградский областной центр социальной помощи семье и детям "Семья"»',
      filename: "11.pdf",
    },
    {
      orgname:
        "Волгоградское региональное общественное учреждение «Кризисно-конфликтный центр»",
      filename: "12.pdf",
    },
  ],
  Бабаево: [
    {
      orgname:
        "Автономная некомерческая организация «Кризисный центр для лиц, находящихся в трудной жизненной ситуации г.Бабаево»",
      filename: "13.pdf",
    },
  ],
  Череповец: [
    {
      orgname:
        'Некоммерческое Партнерство «Межведомственная служба помощи детям и молодежи "Восхождение"»',
      filename: "14.pdf",
    },
  ],
  Воронеж: [
    {
      orgname:
        'Казенное учреждение Воронежской области «Областной центр социальной помощи семье и детям "Буревестник"»',
      filename: "15.pdf",
    },
    {
      orgname:
        'Воронежская общественная организация «Воронежский городской форум независимой женской демократической инициативы ("НеЖДИ")»',
      filename: "16.pdf",
    },
  ],
  Иркутск: [
    {
      orgname:
        "Иркутская городская некоммерческая общественная организация «Кризисный центр для женщин»",
      filename: "17.pdf",
    },
    { orgname: "Кризисный центр для женщин «Мария»", filename: "18.pdf" },
    {
      orgname:
        "Благотворительный общественный Фонд Иркутской области «ОберегЪ»",
      filename: "19.pdf",
    },
    { orgname: "Кризисный центр для женщин", filename: "21.pdf" },
  ],
  Шелехов: [
    {
      orgname: "Шелеховский общественный благотворительный фонд «Гармония»",
      filename: "20.pdf",
    },
  ],
  Калининград: [
    {
      orgname:
        "Кризисный центр для беременных женщин и женщин с детьми «Обитель» (действует при поддержке Синодального отдела по церковной благотворительности и социальному служению Русской Православной Церкви)",
      filename: "22.pdf",
    },
  ],
  Пионерский: [
    {
      orgname:
        "ГАУ Калининградской Области «Областной Кризисный Центр Помощи Женщинам»",
      filename: "23.pdf",
    },
  ],
  "Барятинский район, село Барятино": [
    {
      orgname:
        'Филиал ГБУ Калужской области «Центр социальной помощи семье и детям "Чайка" "Надежда"»',
      filename: "24.pdf",
    },
  ],
  "Жиздринский район, д. Мужитино": [
    {
      orgname:
        'Филиал ГБУ Калужской области «Центр социальной помощи семье и детям "Чайка" "Русич"»',
      filename: "25.pdf",
    },
  ],
  "Куйбышевский район, с. пос. Село Бутчино, д. Ветьмица": [
    {
      orgname:
        'Филиал ГБУ Калужской области «Центр социальной помощи семье и детям "Чайка" "Берегиня"»',
      filename: "26.pdf",
    },
  ],
  Людиново: [
    {
      orgname:
        "ГБУ Калужской области Центр социальной помощи семье и детям «Чайка»",
      filename: "27.pdf",
    },
  ],
  "Петропавловск-Камчатский": [
    { orgname: "Кризисный центр для женщин «Надежда»", filename: "28.pdf" },
  ],
  Кемерово: [
    {
      orgname:
        "МБУ «Комплексный центр социального обслуживания населения Центрального района города Кемерово»",
      filename: "29.pdf",
    },
  ],
  Киров: [
    {
      orgname:
        "Приют «Вифлеем в Вятке«» (Центр для беременных женщин, оказавшихся в сложной жизненной ситуации)",
      filename: "30.pdf",
    },
  ],
  Кострома: [
    {
      orgname:
        "ГКУ «Костромской областной Центр социальной помощи семье и детям»",
      filename: "31.pdf",
    },
  ],
  Армавир: [
    {
      orgname:
        "Краснодарская краевая правозащитная общественная организация «Правое дело»",
      filename: "32.pdf",
    },
  ],
  Белореченск: [
    { orgname: "Белореченская ГОО «Мир Детства»", filename: "33.pdf" },
  ],
  Краснодар: [
    {
      orgname:
        "ГБУСО Краснодарского края «Краснодарский краевой кризисный центр помощи женщинам»",
      filename: "34.pdf",
    },
  ],
  "Тбилисский район, станица Тбилисская": [
    {
      orgname: "Общественное движение женщин Тбилисского района «Надежда»",
      filename: "35.pdf",
    },
  ],
  Сочи: [
    {
      orgname:
        "Обеспечение временного приюта кризисным беременным и женщинам с детьми, попавшими в трудную жизненную ситуацию",
      filename: "36.pdf",
    },
  ],
  Красноярск: [
    {
      orgname:
        'Красноярская РОО «Кризисный центр для женщин и их семей, подвергшихся насилию "Верба"»',
      filename: "37.pdf",
    },
    {
      orgname:
        'МБУ «Городской Центр Социального Обслуживания Населения "Родник"»',
      filename: "38.pdf",
    },
    {
      orgname:
        '«Кризисный центр для женщин и их семей, подвергшихся насилию "Верба"»',
      filename: "40.pdf",
    },
  ],
  Норильск: [
    {
      orgname:
        "МБУ «КЦСОН МО города Норильска», отделение психолого-педагогической помощи детям, семьям, женщинам, оказавшимся в трудной жизненной ситуации",
      filename: "39.pdf",
    },
  ],
  Курган: [
    {
      orgname:
        "ГБУ «Курганский центр социальной помощи семье и детям», Кризисное отделение «Время перемен»",
      filename: "41.pdf",
    },
  ],
  "Санкт-Петербург": [
    {
      orgname:
        'Санкт-Петербургское ГБУ «Кризисный центр помощи женщинам», отделение социальной реабилитации "Маленькая Мама"',
      filename: "42.pdf",
    },
    {
      orgname:
        "Санкт-Петербургское ГУ «Территориальный центр социальной помощи семье и детям»",
      filename: "43.pdf",
    },
    {
      orgname: "Санкт-Петербургская РОО ИНГО Кризисный центр для женщин",
      filename: "44.pdf",
    },
    {
      orgname:
        "АНО Центр поддержки детства и материнства в кризисных ситуациях «Свет Надежды»",
      filename: "45.pdf",
    },
    {
      orgname:
        "РОО социальных проектов в сфере благополучия населения «Стеллит»",
      filename: "46.pdf",
    },
    {
      orgname:
        "СПб ОО «Служба социально юридической помощи пострадавшим от насилия»",
      filename: "47.pdf",
    },
    {
      orgname:
        'Санкт-Петербургская ОО по гармоничному развитию семьи и личности «Центр "Радомира"»',
      filename: "48.pdf",
    },
    {
      orgname:
        "Учреждение «Центр социальной помощи семье и детям Адмиралтейского района Санкт-Петербурга»",
      filename: "49.pdf",
    },
    {
      orgname:
        "ГБУ «Центр социальной помощи семье и детям Василеостровского района»",
      filename: "50.pdf",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Центр социальной помощи семье и детям Выборгского района Санкт-Петербурга»",
      filename: "51.pdf",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Центр социальной помощи семье и детям Кировского района Санкт-Петербурга»",
      filename: "52.pdf",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Центр социальной помощи семье и детям Калининского района»",
      filename: "53.pdf",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Комплексный центр социального обслуживания населения Красносельского района»",
      filename: "54.pdf",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Комплексный центр социального обслуживания населения Курортного района»",
      filename: "55.pdf",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Центр социальной помощи семье и детям Красногвардейского района Санкт-Петербурга», Отделение помощи женщинам, оказавшимся в трудной жизненной ситуации «Охта»",
      filename: "56.pdf",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Центр социальной помощи семье и детям Московского района»",
      filename: "57.pdf",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Центр социальной помощи семье и детям Невского района Санкт–Петербурга»",
      filename: "58.pdf",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Центр Социальной Помощи Семье и Детям Петроградского Района»",
      filename: "59.pdf",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Центр социальной помощи семье и детям Петродворцового района Санкт-Петербурга»",
      filename: "60.pdf",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Центр Социальной Помощи Семье и Детям Приморского Района»",
      filename: "61.pdf",
    },
    {
      orgname:
        'Санкт-Петербургское ГБУ «Центр Социальной Помощи Семье и Детям Пушкинского района "Аист"»',
      filename: "62.pdf",
    },
    {
      orgname:
        "Санкт-Петербургская БОО поддержки социальных инициатив «Содействие»",
      filename: "63.pdf",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Центр Социальной Помощи Семье и Детям Фрунзенского Района»",
      filename: "64.pdf",
    },
    {
      orgname:
        "Санкт-Петербургское ГБУ «Центр Социальной Помощи Семье и Детям Центрального района»",
      filename: "65.pdf",
    },
  ],
  Липецк: [
    {
      orgname: "ОКУ «Кризисный центр помощи женщинам и детям г. Липецк»",
      filename: "66.pdf",
    },
  ],
  Магадан: [
    {
      orgname:
        "Отдел социальной помощи семье и детям Магаданского социального центра",
      filename: "67.pdf",
    },
  ],
  Москва: [
    {
      orgname: "Консорциум женских неправительственных объединений",
      filename: "68.pdf",
    },
    {
      orgname: "Национальный центр по предотвращению насилия «Анна»",
      filename: "69.pdf",
    },
    {
      orgname:
        "Независимый благотворительный Центр помощи пережившим сексуальное насилие «Сестры»",
      filename: "70.pdf",
    },
    {
      orgname: "Благотворительный Фонд «Женщины и дети прежде всего»",
      filename: "71.pdf",
    },
    {
      orgname:
        "ГБУ г. Москвы Центр социальной помощи семье и детям «Благополучие»",
      filename: "72.pdf",
    },
    { orgname: "Благотворительный фонд «Безопасный дом»", filename: "73.pdf" },
    {
      orgname:
        "ГБУ города Москвы Центр социальной помощи семье и детям «Гелиос», отделение помощи женщинам, оказавшимся в кризисной ситуации",
      filename: "74.pdf",
    },
    {
      orgname: "Филиал «Надежда» ГБУ «Кризисный центр помощи женщинам и детям»",
      filename: "75.pdf",
    },
    { orgname: "Кризисный центр «Дом для мамы»", filename: "76.pdf" },
    {
      orgname:
        "АНО «Центр помощи семьям, находящимся в трудной жизненной ситуации “Китеж”»",
      filename: "77.pdf",
    },
    {
      orgname:
        "Филиал «Специализированный дом ребенка» ГБУ «Кризисный центр помощи женщинам и детям»",
      filename: "78.pdf",
    },
    {
      orgname:
        "Центр психологической помощи Pro Bono «Школа антикризисного реагирования» (ШАР)",
      filename: "79.pdf",
    },
    {
      orgname: "ГБУ «Кризисный центр помощи женщинам и детям»",
      filename: "80.pdf",
    },
    { orgname: "Благотворительный фонд «Насилию.нет»", filename: "81.pdf" },
  ],
  Дмитров: [
    {
      orgname:
        "Дмитровский центр социальной помощи семье и детям; отделение помощи женщинам, оказавшимся в трудной жизненной ситуации",
      filename: "82.pdf",
    },
  ],
  Дубна: [
    {
      orgname: "ННО Женский информационно-образовательный центр «Стимула»",
      filename: "83.pdf",
    },
  ],
  "г.о. Кашира, д. Лиды": [
    {
      orgname:
        'ГКУСО Московской области «Каширский специализированный социально-реабилитационный центр для несовершеннолетних "Семья"»',
      filename: "84.pdf",
    },
  ],
  Клин: [
    {
      orgname:
        'ГБУСО Московской области «Клинский центр социальной помощи семье и детям "Семья"»',
      filename: "85.pdf",
    },
  ],
  Щёлково: [
    {
      orgname:
        'ГБУСО Московской области «Щёлковский центр психолого-педагогической помощи населению "Янтарь"»',
      filename: "86.pdf",
    },
  ],
  Апатиты: [
    {
      orgname:
        "ГОАУСО Отделение для несовершеннолетних нуждающихся в социальной реабилитации",
      filename: "87.pdf",
    },
  ],
  Мурманск: [
    {
      orgname: "ГОБУСОН «Мурманский центр социальной помощи семье и детям»",
      filename: "88.pdf",
    },
  ],
  Арзамас: [
    {
      orgname: "Центр социальной помощи семье и детям г. Арзамаса",
      filename: "89.pdf",
    },
  ],
  Балахна: [
    {
      orgname:
        "ГБУ «Центр социальной помощи семье и детям ”Гармония” Балахнинского района»",
      filename: "90.pdf",
    },
  ],
  Городец: [
    {
      orgname: "ГБУ «Центр социальной помощи семье и детям Городецкого района»",
      filename: "91.pdf",
    },
    {
      orgname: "Нижегородская РОО «Кризисный центр Александра»",
      filename: "92.pdf",
    },
  ],
  "Нижний Новгород": [
    { orgname: "Нижегородский Женский Кризисный Центр", filename: "93.pdf" },
  ],
  Чкаловск: [
    {
      orgname:
        "ГБУ «Комплексный центр социального обслуживания населения Чкаловского района»",
      filename: "94.pdf",
    },
  ],
  "Великий Новгород": [
    { orgname: "ОБУСО «Кризисный центр помощи женщинам»", filename: "95.pdf" },
    { orgname: "РОО «Новгородский Гендерный центр»", filename: "96.pdf" },
  ],
  Новосибирск: [
    {
      orgname:
        "Новосибирское областное общественное объединение Женское Инициативное Творческое Объединение «Служба семьи Новосибирска»",
      filename: "97.pdf",
    },
  ],
  Омск: [
    {
      orgname:
        'Омская РОО «Центр охраны здоровья и социальной защиты "Сибальт"»',
      filename: "98.pdf",
    },
    {
      orgname:
        "Бюджетное учреждение Омской области «Центр социальной помощи семье и детям (с социальной гостиницей)»",
      filename: "99.pdf",
    },
  ],
  Орёл: [
    {
      orgname:
        'БУ Орловской обл. «Кризисный центр помощи женщинам и детям "Орловский"\\»',
      filename: "100.pdf",
    },
  ],
  Пенза: [
    {
      orgname:
        "Кризисный центр по оказанию помощи женщинам и детям, оказавшимся в трудной жизненной ситуации",
      filename: "101.pdf",
    },
  ],
  Пермь: [
    { orgname: "КГАУ «Центр социальной адаптации»", filename: "102.pdf" },
  ],
  Владивосток: [
    {
      orgname:
        "АНО «Дальневосточный центр развития гражданских инициатив и социального партнерства»",
      filename: "103.pdf",
    },
    {
      orgname: "КГАУСО «Приморский центр социального обслуживания населения»",
      filename: "104.pdf",
    },
    {
      orgname:
        "Кризисный центр «Ирис» (при Владивостокском городском Совете женщин)",
      filename: "105.pdf",
    },
  ],
  Псков: [
    {
      orgname:
        "Псковская областная общественная организация «Независимый социальный женский центр»",
      filename: "106.pdf",
    },
  ],
  Майкоп: [
    {
      orgname: "Центр по профилактике домашнего насилия «Фемина»",
      filename: "107.pdf",
    },
  ],
  Уфа: [
    {
      orgname:
        "КЦСОН «Изгелек» Кировского района городского округа город Уфа Республики Башкортостан",
      filename: "108.pdf",
    },
  ],
  Северобайкальск: [
    {
      orgname:
        'ГУСО «Социально-реабилитационный центр для несовершеннолетних "Надежда"»',
      filename: "109.pdf",
    },
  ],
  "Улан-Удэ": [
    {
      orgname: "Центр социальной помощи для семей с детьми",
      filename: "110.pdf",
    },
  ],
  Каспийск: [
    {
      orgname: "Дагестанская РОО Психологов и Социальных Работников «Психея»",
      filename: "111.pdf",
    },
  ],
  Кизляр: [{ orgname: "РОО «Твори добро»", filename: "112.pdf" }],
  Махачкала: [
    { orgname: "РОО «Мать и Дитя»", filename: "113.pdf" },
    { orgname: "СО ДРОО «Октава»", filename: "114.pdf" },
    {
      orgname: "Общественное движение «Дагестан без сирот»",
      filename: "115.pdf",
    },
    {
      orgname: "Центр защиты материнства и детства АНО «Теплый дом на горе»",
      filename: "116.pdf",
    },
  ],
  Петрозаводск: [
    {
      orgname:
        'Государственного бюджетного учреждения социального обслуживания Республики Карелия «Республиканский центр социальной помощи семье и детям "Сампо"»',
      filename: "117.pdf",
    },
    {
      orgname:
        "МБУСО Петрозаводского городского округа Комплексный центр социального обслуживания населения «Истоки»",
      filename: "118.pdf",
    },
    {
      orgname: "РОО «Карельский центр гендерных исследований»",
      filename: "119.pdf",
    },
  ],
  "Сортавальское гор.пос. Сортавала": [
    {
      orgname:
        "МБУ «Комплексный Центр социального обслуживания населения» Сортавальского муниципального района, отделение помощи женщинам, оказавшимся в трудной жизненной ситуации",
      filename: "120.pdf",
    },
  ],
  Сыктывкар: [
    {
      orgname:
        "ГБУ Республики Коми «Центр по предоставлению государственных услуг в сфере социальной защиты населения города Сыктывкара»",
      filename: "121.pdf",
    },
  ],
  Ухта: [
    {
      orgname:
        "ГБУ Республики Коми «Центр социальной помощи семье и детям города Ухты»",
      filename: "122.pdf",
    },
  ],
  Саранск: [
    {
      orgname:
        "Мордовской республиканский клинический перинатальный центр кризисный центр для женщин",
      filename: "123.pdf",
    },
  ],
  Якутск: [
    {
      orgname:
        "Центр социально-психологической поддержки семьи и молодежи Республики Саха",
      filename: "124.pdf",
    },
  ],
  Казань: [
    {
      orgname:
        'ГАУСО «Республиканский информационно-методический центр социальной помощи семье и детям "Гаиле"»',
      filename: "125.pdf",
    },
    { orgname: "Женский кризисный центр «Фатима»", filename: "126.pdf" },
    { orgname: "ТРОО Деловые женщины Татарстана", filename: "127.pdf" },
    {
      orgname:
        "Всемирный Татарский конгресс; Всемирная татарская женская организация",
      filename: "128.pdf",
    },
  ],
  Азов: [
    {
      orgname:
        "ГБУСОН Ростовской обл. «Центр социальной помощи семье и детям – Дом семьи г. Азов»",
      filename: "129.pdf",
    },
  ],
  "Ростов-на-Дону": [
    {
      orgname:
        "ГБУСОН Ростовской обл. «Азовский детский дом-интернат для умственно отсталых детей»",
      filename: "130.pdf",
    },
    { orgname: "", filename: "144.pdf" },
    {
      orgname: "АНО «Региональный ресурсный центр по профилактике насилия»",
      filename: "145.pdf",
    },
  ],
  "Азовский район, село Кулешовка": [
    {
      orgname:
        "ГУСОН Ростовской обл. «Социально-реабилитационный центр для несовершеннолетних Азовского района»",
      filename: "131.pdf",
    },
  ],
  Батайск: [
    {
      orgname:
        "ГБУСОН Ростовской области «Социальный приют для детей и подростков г. Батайска»",
      filename: "132.pdf",
    },
  ],
  "Белая Калитва": [
    {
      orgname:
        "ГБУСОН Ростовской области «Социально-реабилитационный центр для несовершеннолетних Белокалитвинского района»",
      filename: "133.pdf",
    },
  ],
  "Шолоховский район, станица Вешенская": [
    {
      orgname:
        "ГБУСОН Ростовской обл. «Центр Психолого-педагогической Помощи Населению СТ. Вешенской Шолоховского района»",
      filename: "134.pdf",
    },
  ],
  Волгодонск: [
    {
      orgname: "АНО Региональный Ресурсный центр «Здоровая семья»",
      filename: "135.pdf",
    },
  ],
  Гуково: [
    {
      orgname:
        "ГБУСОН Ростовской области «Социально-реабилитационный центр для несовершеннолетних г. Гуково»",
      filename: "136.pdf",
    },
  ],
  Донецк: [
    {
      orgname: "ГБУСОН РО «Центр социальной помощи семье и детям г. Донецка»",
      filename: "137.pdf",
    },
  ],
  "Егорлыкский район, станица Егорлыкская": [
    {
      orgname:
        "ГБУСОН Ростовской области «Социально-реабилитационный центр для несовершеннолетних Егорлыкского района»",
      filename: "138.pdf",
    },
  ],
  Зерноград: [
    {
      orgname:
        "ГБУСОН Ростовской области. «Социально-реабилитационный центр для несовершеннолетних Зерноградского района»",
      filename: "139.pdf",
    },
  ],
  "Каменский район, пос. Чистоозерный": [
    {
      orgname:
        "ГБУСОН Ростовской обл. «Реабилитационный центр для детей и подростков с ограниченными возможностями Каменского района»",
      filename: "140.pdf",
    },
  ],
  "Красный Сулин": [
    {
      orgname:
        "ГБУСОН Ростовской области «Социально-реабилитационный центр для несовершеннолетних г. Красного Сулина»",
      filename: "141.pdf",
    },
  ],
  "Куйбышевский р-н, с. Куйбышево": [
    {
      orgname:
        "ГБУСОН Ростовской области «Социально-реабилитационный центр для несовершеннолетних Куйбышевского района»",
      filename: "142.pdf",
    },
  ],
  "Песчанокопский р-н, с. Песчанокопское": [
    {
      orgname:
        "ГУ Ростовской Области «Центр социальной помощи семье и детям г. Ростова-на-Дону»",
      filename: "143.pdf",
    },
  ],
  Сальск: [
    {
      orgname:
        "ГБУСОН Ростовской области «Социально –реабилитационный центр для несовершеннолетних Сальского района»",
      filename: "146.pdf",
    },
  ],
  Семикаракорск: [
    {
      orgname:
        "ГБУСОН Ростовской области «Центр социальной помощи семье и детям Семикаракорского района»",
      filename: "147.pdf",
    },
  ],
  "Советский район, ст. Советская": [
    {
      orgname:
        "ГБУСОН Ростовской обл. «Центр социальной помощи семье и детям Советского района»",
      filename: "148.pdf",
    },
  ],
  Таганрог: [{ orgname: "УСЗН г.Таганрога", filename: "149.pdf" }],
  "Тацинский район, пос. Быстрогорский": [
    {
      orgname:
        "ГБУСОН Ростовской области «Социально-реабилитационный центр для несовершеннолетних Тацинского района»",
      filename: "150.pdf",
    },
  ],
  Шахты: [
    {
      orgname:
        'ГБУСОН Ростовской области «Реабилитационный центр "Добродея" для детей и подростков с ограниченными возможностями: дефектами умственного и физического развития г. Шахты»',
      filename: "151.pdf",
    },
    {
      orgname:
        "ГБУСОН Ростовской области «Социально-реабилитационный центр для несовершеннолетних г. Шахты»",
      filename: "152.pdf",
    },
  ],
  Тольятти: [
    { orgname: "АНО «Открытая Альтернатива»", filename: "153.pdf" },
    {
      orgname:
        'ГКУ Самарской области «Тольяттинский социальный приют для детей и подростков "Дельфин" (с кризисным отделением для женщин)»',
      filename: "154.pdf",
    },
  ],
  Самара: [
    {
      orgname:
        "Проект «Знание остановит гендерное насилие: поиск новых решений»",
      filename: "155.pdf",
    },
    {
      orgname: "Знание остановит гендерное насилие: поиск новых решений",
      filename: "156.pdf",
    },
  ],
  Балаково: [
    {
      orgname:
        'ГБУ Саратовской обл. «Балаковский центр социальной помощи семье и детям "Семья"»',
      filename: "157.pdf",
    },
  ],
  Вольск: [
    {
      orgname:
        'ГБУ Саратовской области «Социально-реабилитационный центр для несовершеннолетних "Волжанка"»',
      filename: "158.pdf",
    },
  ],
  Красноармейск: [
    {
      orgname:
        'Государственное бюджетное учреждение Саратовской области «Красноармейский центр социальной помощи семье и детям "Семья"»',
      filename: "159.pdf",
    },
  ],
  Саратов: [
    {
      orgname:
        "ГБУ Саратовской области «Центр социальной помощи семье и детям г. Саратова»",
      filename: "160.pdf",
    },
  ],
  Энгельс: [
    {
      orgname:
        'ГАУ Саратовской области «Энгельсский центр социальной помощи семье и детям "Семья"»',
      filename: "161.pdf",
    },
    {
      orgname:
        'ГБУ Саратовской области «Красноармейский центр социальной помощи семье и детям "Семья"»',
      filename: "163.pdf",
    },
  ],
  Хвалынск: [
    {
      orgname: "ОГУ «Хвалынскиий центр социальной помощи семье и детям»",
      filename: "162.pdf",
    },
  ],
  "Южно-Сахалинск": [
    { orgname: "Благотворительный фонд «Радость жизни»", filename: "164.pdf" },
  ],
  "Артёмовский г.о., пгт Буланаш": [
    {
      orgname:
        "ГБУСОН Свердловской области «Центр социальной помощи семье и детям Артемовского района»",
      filename: "165.pdf",
    },
  ],
  Богданович: [
    {
      orgname:
        "ГАУСОН Свердловской области «Центр социальной помощи семье и детям города Богдановича»",
      filename: "166.pdf",
    },
  ],
  Екатеринбург: [
    {
      orgname:
        "Свердловская региональная общественная организация «Женский юрист»",
      filename: "167.pdf",
    },
    {
      orgname:
        'Свердловская региональная общественная организация «Кризисный центр для женщин и детей, переживших насилие в семье "Екатерина"»',
      filename: "168.pdf",
    },
    {
      orgname: "Некоммерческое партнерство «Семья детям»",
      filename: "169.pdf",
    },
    {
      orgname:
        'ГБУСОН Свердловской области «Центр социальной помощи семье и детям "Гнездышко" Кировского района города Екатеринбурга»',
      filename: "170.pdf",
    },
    {
      orgname:
        'ГБУ «КЦСОН "Малахит" Орджоникидзевского района города Екатеринбурга»',
      filename: "171.pdf",
    },
  ],
  "Каменск-Уральский": [
    {
      orgname:
        "Комплексный центр социального обслуживания населения города Каменска-Уральского",
      filename: "172.pdf",
    },
  ],
  "Каменск-Уральский, пос. Трубный": [
    {
      orgname:
        "Социально-реабилитационный центр для несовершеннолетних «Лада» г. Каменск-Уральский",
      filename: "173.pdf",
    },
  ],
  "Нижний Тагил": [
    {
      orgname: "АНО «Центр семейной терапии и консультирования»",
      filename: "174.pdf",
    },
    {
      orgname: "Центр социальной помощи семье и детям «Рябинушка»",
      filename: "175.pdf",
    },
    {
      orgname: "АНО «Центр семейной терапии и консультирования»",
      filename: "176.pdf",
    },
  ],
  "Нижняя Тура": [
    {
      orgname:
        "Центр социальной помощи семье и детям г. Нижняя Тура, кризисное отделение для женщин, оказавшихся в трудной жизненной ситуации",
      filename: "177.pdf",
    },
  ],
  Полевской: [
    {
      orgname: "Центр социальной помощи семье и детям города Полевского",
      filename: "178.pdf",
    },
  ],
  Ревда: [
    {
      orgname:
        "Социально-реабилитационный центр Ревдинского района; отделение помощи женщинам, оказавшимся в трудной жизненной ситуации",
      filename: "179.pdf",
    },
  ],
  Тавда: [
    {
      orgname:
        "Социально-реабилитационный центр для несовершеннолетних Тавдинского района «Золушка»",
      filename: "180.pdf",
    },
  ],
  Смоленск: [
    { orgname: "МОО «Центр социальной поддержки женщин»", filename: "181.pdf" },
  ],
  Ставрополь: [
    {
      orgname: "ГБУСО «Ставропольский центр социальной помощи семье и детям»",
      filename: "182.pdf",
    },
  ],
  Ессентуки: [{ orgname: "АНО «Дом для мамы»", filename: "183.pdf" }],
  Томск: [
    {
      orgname:
        "Служба «Кризисный центр для женщин» муниципального учреждения профилактики и социальной адаптации «Семья» г. Томска",
      filename: "184.pdf",
    },
  ],
  Тула: [
    {
      orgname: "ГУСОН Тульской области «Кризисный центр помощи женщинам»",
      filename: "185.pdf",
    },
  ],
  Тюмень: [
    {
      orgname:
        "АУ Тюменской области дополнительного профессионального образования и развития социальных технологий «Семья»",
      filename: "186.pdf",
    },
  ],
  Ижевск: [
    {
      orgname:
        'Региональная общественная организация Удмуртской Республики «Центр поддержки семьи и детей "Теплый дом"»',
      filename: "187.pdf",
    },
    {
      orgname:
        "БУ центр социальной помощи семье и детям Октябрьского района г. Ижевска",
      filename: "188.pdf",
    },
    { orgname: "КЦСОН Ленинского района г.Ижевска", filename: "189.pdf" },
  ],
  Ульяновск: [
    {
      orgname:
        'ОГКУСО «Центр социально-психологической помощи семье и детям "Семья"»',
      filename: "190.pdf",
    },
  ],
  "Комсомольск-на-Амуре": [
    {
      orgname:
        "Отделение помощи женщинам, оказавшимся в трудной жизненной ситуации",
      filename: "191.pdf",
    },
  ],
  Хабаровск: [
    {
      orgname:
        "Отделение помощи женщинам, оказавшимся в трудной жизненной ситуации",
      filename: "192.pdf",
    },
    {
      orgname:
        "НЕ ОДНА — кризисный центр для женщин краевой общественной организации «Милосердие»",
      filename: "193.pdf",
    },
  ],
  Нефтеюганск: [
    {
      orgname: "БУ ХМАО-Югры Центр социальной помощи семье и детям «Веста»",
      filename: "194.pdf",
    },
  ],
  Нижневартовск: [
    {
      orgname:
        'БУ ХМАО – Югры «Центр социальной помощи семье и детям "Кардея"»',
      filename: "195.pdf",
    },
    { orgname: "Кризисный центр «Надежный дом»", filename: "196.pdf" },
    {
      orgname:
        "Отделение помощи женщинам, оказавшимся в трудной жизненной ситуации",
      filename: "197.pdf",
    },
  ],
  Челябинск: [
    { orgname: "АНО «Обитель»", filename: "198.pdf" },
    {
      orgname: 'МБУ «Центр профилактического сопровождения "Компас"»',
      filename: "199.pdf",
    },
    { orgname: "МУСО «Кризисный центр» г. Челябинска", filename: "200.pdf" },
    {
      orgname:
        'АНО «Центр социальной поддержки семей, находящихся в трудной жизненной ситуации "Возможность"»',
      filename: "201.pdf",
    },
  ],
  Грозный: [
    { orgname: "АНО «Женщины за развитие»", filename: "202.pdf" },
    {
      orgname:
        "Чеченская РОО Ресурсный социально – психологический центр «Синтем – Успокоение души»",
      filename: "203.pdf",
    },
    {
      orgname:
        "Чеченская Региональная Правозащитная Общественная Организация «Нийсо» (Справедливость)",
      filename: "204.pdf",
    },
    {
      orgname: "Чеченская РОО Информационно-правовой центр «Элиф»",
      filename: "205.pdf",
    },
    {
      orgname:
        "Межрегиональное движение в защиту прав и свобод человека «Коалиция»",
      filename: "206.pdf",
    },
  ],
  Чебоксары: [
    {
      orgname:
        "БУ «Социально-реабилитационный центр для несовершеннолетних г. Чебоксары» Минздравсоцразвития Чувашии",
      filename: "207.pdf",
    },
  ],
  Салехард: [
    {
      orgname:
        'ГКУ ЯНАО «Социально-реабилитационный центр для несовершеннолетних "Доверие" г. Салехард»',
      filename: "208.pdf",
    },
  ],
  "Пуровский р-н, Тарко-Сале": [
    {
      orgname:
        "ГБУ «Центр социального обслуживания населения в мо Пуровский район», Отделение помощи гражданам, оказавшимся в трудной жизненной ситуации",
      filename: "209.pdf",
    },
  ],
  "Новый Уренгой": [
    {
      orgname:
        'Государственное бюджетное учреждение ЯНАО «Центр социальной помощи семье и детям "Садко"»',
      filename: "210.pdf",
    },
  ],
  Рыбинск: [
    {
      orgname: 'Некоммерческое партнерство «Центр семьи "Ариадна"»',
      filename: "211.pdf",
    },
  ],
};
var CITIES = [
  { name: "Азов", value: "Азов" },
  {
    name: "Азовский район, село Кулешовка",
    value: "Азовский район, село Кулешовка",
  },
  { name: "Апатиты", value: "Апатиты" },
  { name: "Арзамас", value: "Арзамас" },
  { name: "Армавир", value: "Армавир" },
  {
    name: "Артёмовский г.о., пгт Буланаш",
    value: "Артёмовский г.о., пгт Буланаш",
  },
  { name: "Архангельск", value: "Архангельск" },
  { name: "Астрахань", value: "Астрахань" },
  { name: "Бабаево", value: "Бабаево" },
  { name: "Балаково", value: "Балаково" },
  { name: "Балахна", value: "Балахна" },
  { name: "Барнаул", value: "Барнаул" },
  {
    name: "Барятинский район, село Барятино",
    value: "Барятинский район, село Барятино",
  },
  { name: "Батайск", value: "Батайск" },
  { name: "Белая Калитва", value: "Белая Калитва" },
  { name: "Белореченск", value: "Белореченск" },
  { name: "Богданович", value: "Богданович" },
  { name: "Великий Новгород", value: "Великий Новгород" },
  { name: "Владивосток", value: "Владивосток" },
  { name: "Владимир", value: "Владимир" },
  { name: "Волгоград", value: "Волгоград" },
  { name: "Волгодонск", value: "Волгодонск" },
  { name: "Вольск", value: "Вольск" },
  { name: "Воронеж", value: "Воронеж" },
  { name: "Город", value: "Город" },
  { name: "Городец", value: "Городец" },
  { name: "Грозный", value: "Грозный" },
  { name: "Гуково", value: "Гуково" },
  { name: "Гусь-Хрустальный", value: "Гусь-Хрустальный" },
  { name: "Дмитров", value: "Дмитров" },
  { name: "Донецк", value: "Донецк" },
  { name: "Дубна", value: "Дубна" },
  {
    name: "Егорлыкский район, станица Егорлыкская",
    value: "Егорлыкский район, станица Егорлыкская",
  },
  { name: "Екатеринбург", value: "Екатеринбург" },
  { name: "Ессентуки", value: "Ессентуки" },
  {
    name: "Жиздринский район, д. Мужитино",
    value: "Жиздринский район, д. Мужитино",
  },
  { name: "Зерноград", value: "Зерноград" },
  { name: "Ижевск", value: "Ижевск" },
  { name: "Иркутск", value: "Иркутск" },
  { name: "Казань", value: "Казань" },
  { name: "Калининград", value: "Калининград" },
  { name: "Каменск-Уральский", value: "Каменск-Уральский" },
  {
    name: "Каменск-Уральский, пос. Трубный",
    value: "Каменск-Уральский, пос. Трубный",
  },
  {
    name: "Каменский район, пос. Чистоозерный",
    value: "Каменский район, пос. Чистоозерный",
  },
  { name: "Каспийск", value: "Каспийск" },
  { name: "Кемерово", value: "Кемерово" },
  { name: "Кизляр", value: "Кизляр" },
  { name: "Киров", value: "Киров" },
  { name: "Клин", value: "Клин" },
  { name: "Комсомольск-на-Амуре", value: "Комсомольск-на-Амуре" },
  { name: "Кострома", value: "Кострома" },
  { name: "Красноармейск", value: "Красноармейск" },
  { name: "Краснодар", value: "Краснодар" },
  { name: "Красноярск", value: "Красноярск" },
  { name: "Красный Сулин", value: "Красный Сулин" },
  {
    name: "Куйбышевский р-н, с. Куйбышево",
    value: "Куйбышевский р-н, с. Куйбышево",
  },
  {
    name: "Куйбышевский район, с. пос. Село Бутчино, д. Ветьмица",
    value: "Куйбышевский район, с. пос. Село Бутчино, д. Ветьмица",
  },
  { name: "Курган", value: "Курган" },
  { name: "Липецк", value: "Липецк" },
  { name: "Людиново", value: "Людиново" },
  { name: "Магадан", value: "Магадан" },
  { name: "Майкоп", value: "Майкоп" },
  { name: "Махачкала", value: "Махачкала" },
  { name: "Москва", value: "Москва" },
  { name: "Мурманск", value: "Мурманск" },
  { name: "Нефтеюганск", value: "Нефтеюганск" },
  { name: "Нижневартовск", value: "Нижневартовск" },
  { name: "Нижний Новгород", value: "Нижний Новгород" },
  { name: "Нижний Тагил", value: "Нижний Тагил" },
  { name: "Нижняя Тура", value: "Нижняя Тура" },
  { name: "Новосибирск", value: "Новосибирск" },
  { name: "Новый Уренгой", value: "Новый Уренгой" },
  { name: "Норильск", value: "Норильск" },
  { name: "Омск", value: "Омск" },
  { name: "Орёл", value: "Орёл" },
  { name: "Пенза", value: "Пенза" },
  { name: "Пермь", value: "Пермь" },
  {
    name: "Песчанокопский р-н, с. Песчанокопское",
    value: "Песчанокопский р-н, с. Песчанокопское",
  },
  { name: "Петрозаводск", value: "Петрозаводск" },
  { name: "Петропавловск-Камчатский", value: "Петропавловск-Камчатский" },
  { name: "Пионерский", value: "Пионерский" },
  { name: "Полевской", value: "Полевской" },
  { name: "Псков", value: "Псков" },
  { name: "Пуровский р-н, Тарко-Сале", value: "Пуровский р-н, Тарко-Сале" },
  { name: "Ревда", value: "Ревда" },
  { name: "Ростов-на-Дону", value: "Ростов-на-Дону" },
  { name: "Рыбинск", value: "Рыбинск" },
  { name: "Салехард", value: "Салехард" },
  { name: "Сальск", value: "Сальск" },
  { name: "Самара", value: "Самара" },
  { name: "Санкт-Петербург", value: "Санкт-Петербург" },
  { name: "Саранск", value: "Саранск" },
  { name: "Саратов", value: "Саратов" },
  { name: "Северобайкальск", value: "Северобайкальск" },
  { name: "Северодвинск", value: "Северодвинск" },
  { name: "Семикаракорск", value: "Семикаракорск" },
  { name: "Смоленск", value: "Смоленск" },
  {
    name: "Советский район, ст. Советская",
    value: "Советский район, ст. Советская",
  },
  {
    name: "Сортавальское гор.пос. Сортавала",
    value: "Сортавальское гор.пос. Сортавала",
  },
  { name: "Сочи", value: "Сочи" },
  { name: "Ставрополь", value: "Ставрополь" },
  { name: "Сыктывкар", value: "Сыктывкар" },
  { name: "Тавда", value: "Тавда" },
  { name: "Таганрог", value: "Таганрог" },
  {
    name: "Тацинский район, пос. Быстрогорский",
    value: "Тацинский район, пос. Быстрогорский",
  },
  {
    name: "Тбилисский район, станица Тбилисская",
    value: "Тбилисский район, станица Тбилисская",
  },
  { name: "Тольятти", value: "Тольятти" },
  { name: "Томск", value: "Томск" },
  { name: "Трубчевск", value: "Трубчевск" },
  { name: "Тула", value: "Тула" },
  { name: "Тюмень", value: "Тюмень" },
  { name: "Улан-Удэ", value: "Улан-Удэ" },
  { name: "Ульяновск", value: "Ульяновск" },
  { name: "Уфа", value: "Уфа" },
  { name: "Ухта", value: "Ухта" },
  { name: "Хабаровск", value: "Хабаровск" },
  { name: "Хвалынск", value: "Хвалынск" },
  { name: "Чебоксары", value: "Чебоксары" },
  { name: "Челябинск", value: "Челябинск" },
  { name: "Череповец", value: "Череповец" },
  { name: "Чкаловск", value: "Чкаловск" },
  { name: "Шахты", value: "Шахты" },
  { name: "Шелехов", value: "Шелехов" },
  {
    name: "Шолоховский район, станица Вешенская",
    value: "Шолоховский район, станица Вешенская",
  },
  { name: "Щёлково", value: "Щёлково" },
  { name: "Энгельс", value: "Энгельс" },
  { name: "Южно-Сахалинск", value: "Южно-Сахалинск" },
  { name: "Якутск", value: "Якутск" },
  { name: "г.о. Кашира, д. Лиды", value: "г.о. Кашира, д. Лиды" },
];

var API_URL = "https://homevio-backend.herokuapp.com";

var SELECTED_CITY = undefined;
var SELECTED_ITEM = undefined;

function redrawSelectedCenter(selected) {
  if (DATA[SELECTED_CITY] == undefined) {
    console.error("no", SELECTED_CITY, "in centers list");
    return;
  }

  var centers = DATA[SELECTED_CITY];

  if (selected === undefined) {
    SELECTED_ITEM = Math.floor(Math.random() * centers.length);
  } else {
    SELECTED_ITEM = selected;
  }
  console.log(`${SELECTED_CITY}_${SELECTED_ITEM}`);

  var x = "";
  centers.forEach((element, i) => {
    if (i == SELECTED_ITEM) {
      x += `<div class="link item active"><i class="check icon"></i><b>${element.orgname}</b></div>`;
    } else {
      x += `<div class="link item" onclick="redrawSelectedCenter(${i})">${element.orgname}</div>`;
    }
  });

  $("#centers_list").html(x);

  var item = DATA[SELECTED_CITY][SELECTED_ITEM];

  // $("#download_button").attr("href", `${SELECTED_CITY}_${SELECTED_ITEM}.pdf`);
  $("#download_button").attr("href", `${API_URL}/big/${item.filename}`);
  $("#download_button").removeClass("disabled");
  $("#centers_list_parent").removeClass("m_hidden");

  // console.log("ASDBG", DATA[SELECTED_CITY].length);

  if (DATA[SELECTED_CITY].length <= 1) {
    $("#centers_list_comment").addClass("m_hidden");
  } else {
    $("#centers_list_comment").removeClass("m_hidden");
  }
}

function handleDownloadFile(fname) {
  fetch(`${API_URL}/cnt`, { method: "POST" });
}

function buildCityList() {
  console.log(`selected: ${SELECTED_CITY}_${SELECTED_ITEM}`);

  $("#city_dropdown").dropdown({
    placeholder: "Город",
    values: CITIES,
    onChange: function (text, value, element) {
      if (value === undefined || value === SELECTED_CITY) return;
      SELECTED_CITY = value;
      console.log(`${SELECTED_CITY}_${SELECTED_ITEM}`);
      redrawSelectedCenter(undefined);
    },
  });
}

function showModalBySelector(selector) {
  $(selector).modal({ inverted: true }).modal("show");
}

function closeModals() {
  $(".ui.modal").modal("hide");
}

function setDownloadsCounter(cnt) {
  var cnt_description = "объявлений";

  if (cnt % 100 >= 10 && cnt % 100 < 20) {
    //
  } else if (cnt % 10 == 1) {
    cnt_description = "объявление";
  } else if (cnt % 10 == 2 || cnt % 10 == 3 || cnt % 10 == 4) {
    cnt_description = "объявления";
  }

  $("#download_counter_number").text(cnt);
  $("#download_counter_descriptor").text(cnt_description);

  console.log(cnt, cnt_description);
}

$(document).ready(function () {
  fetch(`${API_URL}/cnt`)
    .then((res) => {
      return res.json();
    })
    .then((data) => {
      setDownloadsCounter(data.cnt);
    });

  buildCityList();
});
